bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BSP_Common/image_sensor/bsp_image_sensor.c
/*
 * Copyright (c) 2016-2023 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "bflb_platform.h"
#include "bsp_image_sensor.h"
#include "bl702_glb.h"
#include "hal_gpio.h"
#include "hal_timer.h"
#include "hal_i2c.h"
#include "hal_cam.h"
#include "hal_mjpeg.h"
#include "hal_clock.h"

#define IMAGE_SENSOR_BF2013 0
#define IMAGE_SENSOR_GC0308 1
#define IMAGE_SENSOR_USE    IMAGE_SENSOR_GC0308

#define CAM_USING_INT_MODE  0
#define CAM_USING_POLL_MODE 1
#define CAM_MODE            CAM_USING_INT_MODE

/* sensor out format */
#define RGB565     0
#define UYVY       1
#define YUYV       2
#define BGRG       3
#define FORMAT_SEL RGB565

#if (IMAGE_SENSOR_USE == IMAGE_SENSOR_BF2013)
#define I2C_CAMERA_ADDR 0x6E
#define BF2013_ID_MSB   0xFC
#define BF2013_ID_LSB   0xFD
#elif (IMAGE_SENSOR_USE == IMAGE_SENSOR_GC0308)
#define I2C_CAMERA_ADDR 0x21
#define GC0308_ID       0x00
#endif

struct device *image_sensor_i2c = NULL;

static const uint8_t sensorRegList[][2] = {
#if (IMAGE_SENSOR_USE == IMAGE_SENSOR_BF2013)
    { 0x12, 0x80 },
    { 0x67, 0x00 },
    { 0x68, 0x00 },
//{0xb9, 0x80},//use Test pattern
//{0x69,0x20},
#if (FORMAT_SEL == UYVY)
    { 0x3a, 0x02 },
#elif (FORMAT_SEL == YUYV)
    { 0x3a, 0x00 },
#endif
    { 0x09, 0x01 },
    { 0x15, 0x02 },
    { 0x12, 0x00 },
    { 0x1e, 0x00 },
    { 0x13, 0x00 },
    { 0x01, 0x14 },
    { 0x02, 0x21 },
    { 0x8c, 0x02 },
    { 0x8d, 0x64 },
    { 0x87, 0x18 },
    { 0x13, 0x07 },
    //{0x11,0x80},//pclk=mclk
    { 0x11, 0x30 }, //pclk=mclk/8
    { 0x2b, 0x20 },
    { 0x92, 0x40 },
    { 0x9d, 0x99 },
    { 0x06, 0xe0 },
    { 0x29, 0x54 },
    { 0xeb, 0x30 },
    { 0xbb, 0x20 },
    { 0xf5, 0x21 },
    { 0xe1, 0x3c },
    { 0x16, 0x01 },
    { 0xe0, 0x0b },
    { 0x2f, 0xf6 },
    { 0x33, 0x20 },
    { 0x34, 0x08 },
    { 0x35, 0x50 },
    { 0x65, 0x4a },
    { 0x66, 0x50 },
    { 0x36, 0x05 },
    { 0x37, 0xf6 },
    { 0x38, 0x46 },
    { 0x9b, 0xf6 },
    { 0x9c, 0x46 },
    { 0xbc, 0x01 },
    { 0xbd, 0xf6 },
    { 0xbe, 0x46 },
    { 0x82, 0x14 },
    { 0x83, 0x23 },
    { 0x9a, 0x23 },
    { 0x70, 0x6f },
    { 0x72, 0x3f },
    { 0x73, 0x3f },
    { 0x74, 0x27 },
    { 0x77, 0x90 },
    { 0x79, 0x48 },
    { 0x7a, 0x1e },
    { 0x7b, 0x30 },
    { 0x84, 0x1a },
    { 0x85, 0x20 },
    { 0x89, 0x02 },
    { 0x8a, 0x64 },
    { 0x86, 0x30 },
    { 0x96, 0xa6 },
    { 0x97, 0x0c },
    { 0x98, 0x18 },
    { 0x80, 0x55 },
    { 0x24, 0x70 },
    { 0x25, 0x80 },
    { 0x94, 0x0a },
    { 0x1f, 0x20 },
    { 0x22, 0x20 },
    { 0x26, 0x20 },
    { 0x56, 0x40 },
    { 0x61, 0xd3 },
    { 0x79, 0x48 },
    { 0x3b, 0x60 },
    { 0x3c, 0x20 },
    { 0x39, 0x80 },
    { 0x3f, 0xb0 },
    { 0x39, 0x80 },
    { 0x40, 0x58 },
    { 0x41, 0x54 },
    { 0x42, 0x4e },
    { 0x43, 0x44 },
    { 0x44, 0x3e },
    { 0x45, 0x39 },
    { 0x46, 0x35 },
    { 0x47, 0x31 },
    { 0x48, 0x2e },
    { 0x49, 0x2b },
    { 0x4b, 0x29 },
    { 0x4c, 0x27 },
    { 0x4e, 0x23 },
    { 0x4f, 0x20 },
    { 0x50, 0x1e },
    { 0x51, 0x05 },
    { 0x52, 0x10 },
    { 0x53, 0x0b },
    { 0x54, 0x15 },
    { 0x57, 0x87 },
    { 0x58, 0x72 },
    { 0x59, 0x5f },
    { 0x5a, 0x7e },
    { 0x5b, 0x1f },
    { 0x5c, 0x0e },
    { 0x5d, 0x95 },
    { 0x60, 0x28 },
    { 0xb0, 0xe0 },
    { 0xb1, 0xc0 },
    { 0xb2, 0xb0 },
    { 0xb3, 0x88 },
    { 0x6a, 0x01 },
    { 0x23, 0x66 },
    { 0xa0, 0x03 },
    { 0xa1, 0x31 },
    { 0xa2, 0x0b },
    { 0xa3, 0x26 },
    { 0xa4, 0x05 },
    { 0xa5, 0x25 },
    { 0xa6, 0x06 },
    { 0xa7, 0x80 },
    { 0xa8, 0x80 },
    { 0xa9, 0x20 },
    { 0xaa, 0x20 },
    { 0xab, 0x20 },
    { 0xac, 0x3c },
    { 0xad, 0xf0 },
    { 0xc8, 0x18 },
    { 0xc9, 0x20 },
    { 0xca, 0x17 },
    { 0xcb, 0x1f },
    { 0xaf, 0x00 },
    { 0xc5, 0x18 },
    { 0xc6, 0x00 },
    { 0xc7, 0x20 },
    { 0xae, 0x80 },
    { 0xcc, 0x40 },
    { 0xcd, 0x58 },
    { 0xee, 0x4c },
    { 0x8e, 0x07 },
    { 0x8f, 0x79 },

#elif (IMAGE_SENSOR_USE == IMAGE_SENSOR_GC0308)
    { 0xfe, 0x80 },
    { 0xfe, 0x00 }, //set page0
    { 0xd2, 0x00 }, //close/en AEC; d2[7] set 1b'0 en AEC
    { 0x22, 0x55 }, //close AWB
    { 0x5a, 0x50 },
    { 0x5b, 0x40 },
    { 0x5c, 0x48 },
    { 0x22, 0x57 }, //Open AWB
#if 0
    //config for 39 FPS
    {0x01, 0x6a}, //HB 106
    //{0x02 , 0x70},//VB 112
    {0x02, 0x0c}, //change VB from 112 to 12
    {0x0f, 0x00},
    {0xe2, 0x00}, //anti-flicker step [11:8]
    {0xe3, 0x96}, //anti-flicker step [7:0]
    {0xe4, 0x01}, //exp level 1  50.00fps or 20ms
    {0xe5, 0x2c},
    {0xe6, 0x03}, //exp level 2  16.67fps
    {0xe7, 0x84},
    {0xe8, 0x04}, //exp level 3  12.5fps
    {0xe9, 0xb0},
    {0xea, 0x09}, //exp level 4  6.00fps
    {0xeb, 0xc4},
#elif 0
    //config for 33.33 FPS
    { 0x01, 0x6a }, //HB 106
    { 0x02, 0x52 }, //VB 82
    { 0x0f, 0x00 },
    { 0xe2, 0x00 }, //anti-flicker step [11:8]
    { 0xe3, 0x96 }, //anti-flicker step [7:0]
    { 0xe4, 0x01 }, //exp level 1  33.33fps or 30ms
    { 0xe5, 0x2c },
    { 0xe6, 0x03 }, //exp level 2  16.67fps
    { 0xe7, 0x84 },
    { 0xe8, 0x04 }, //exp level 3  12.5fps
    { 0xe9, 0xb0 },
    { 0xea, 0x09 }, //exp level 4  6.00fps
    { 0xeb, 0xc4 },
#else
    //config for 25 FPS
    { 0x01, 0x6a }, //HB 106
    //{0x02 , 0x70},//VB 112
    { 0x02, 0xe8 }, //change VB from 112 to 232
    { 0x0f, 0x00 },
    { 0xe2, 0x00 }, //anti-flicker step [11:8]
    { 0xe3, 0x96 }, //anti-flicker step [7:0]
    { 0xe4, 0x02 }, //exp level 1  25.00fps or 40ms
    { 0xe5, 0x58 },
    { 0xe6, 0x03 }, //exp level 2  16.67fps
    { 0xe7, 0x84 },
    { 0xe8, 0x07 }, //exp level 3  12.5fps
    { 0xe9, 0x08 },
    { 0xea, 0x0d }, //exp level 4  6.00fps
    { 0xeb, 0x7a },
#endif
    { 0xec, 0x20 }, //select max exposure level 1 - highest fps
    { 0xed, 0x04 }, //set AEC select exp min
    { 0x05, 0x00 },
    { 0x06, 0x00 },
    { 0x07, 0x00 },
    { 0x08, 0x00 },
    { 0x09, 0x01 },
    { 0x0a, 0xe8 },
    //{0x0a , 0x70},//change win_height from 488 to 368
    { 0x0b, 0x02 },
    { 0x0c, 0x88 }, //win_width 648
    { 0x0d, 0x02 },
    { 0x0e, 0x02 },
    { 0x10, 0x22 },
    { 0x11, 0xfd },
    { 0x12, 0x2a },
    { 0x13, 0x00 },
    //{0x14 , 0x10},
    { 0x14, 0x13 }, //enable mirror & flip
    //-------------H_V_Switch(4)---------------//
    /*
    1://normal
    {0x14 , 0x10},
    2://IMAGE_H_MIRROR
    {0x14 , 0x11},
    3://IMAGE_V_MIRROR
    {0x14 , 0x12},
    4://IMAGE_HV_MIRROR
    {0x14 , 0x13},*/
    { 0x15, 0x0a },
    { 0x16, 0x05 },
    { 0x17, 0x01 },
    { 0x18, 0x44 },
    { 0x19, 0x44 },
    { 0x1a, 0x1e },
    { 0x1b, 0x00 },
    { 0x1c, 0xc1 },
    { 0x1d, 0x08 },
    { 0x1e, 0x60 },
    { 0x1f, 0x17 },
    { 0x20, 0xff },
    { 0x21, 0xf8 },
    { 0x22, 0x57 },
#if FORMAT_SEL == RGB565
    { 0x24, 0xa6 }, //a6 RGB565
#elif FORMAT_SEL == BGRG
    { 0x24, 0xab }, //ab BGRB RGB24
#elif FORMAT_SEL == UYVY
    { 0x24, 0xa0 }, //a0 Cb Y Cr Y
#elif FORMAT_SEL == YUYV
    { 0x24, 0xa2 }, //a2 Y Cb Y Cr
#endif
    { 0x25, 0x0f },
    //output sync_mode
    //{0x26 , 0x02},//0x03  20101016 zhj
    { 0x26, 0x03 }, //sync mode, high high
    { 0x2f, 0x01 },
    { 0x30, 0xf7 },
    { 0x31, 0x50 },
    { 0x32, 0x00 },
    { 0x39, 0x04 },
    { 0x3a, 0x18 },
    { 0x3b, 0x20 },
    { 0x3c, 0x00 },
    { 0x3d, 0x00 },
    { 0x3e, 0x00 },
    { 0x3f, 0x00 },
    { 0x50, 0x10 },
    { 0x53, 0x82 },
    { 0x54, 0x80 },
    { 0x55, 0x80 },
    { 0x56, 0x82 },
    { 0x8b, 0x40 },
    { 0x8c, 0x40 },
    { 0x8d, 0x40 },
    { 0x8e, 0x2e },
    { 0x8f, 0x2e },
    { 0x90, 0x2e },
    { 0x91, 0x3c },
    { 0x92, 0x50 },
    { 0x5d, 0x12 },
    { 0x5e, 0x1a },
    { 0x5f, 0x24 },
    { 0x60, 0x07 },
    { 0x61, 0x15 },
    { 0x62, 0x08 },
    { 0x64, 0x03 },
    { 0x66, 0xe8 },
    { 0x67, 0x86 },
    { 0x68, 0xa2 },
    { 0x69, 0x18 },
    { 0x6a, 0x0f },
    { 0x6b, 0x00 },
    { 0x6c, 0x5f },
    { 0x6d, 0x8f },
    { 0x6e, 0x55 },
    { 0x6f, 0x38 },
    { 0x70, 0x15 },
    { 0x71, 0x33 },
    { 0x72, 0xdc },
    { 0x73, 0x80 },
    { 0x74, 0x02 },
    { 0x75, 0x3f },
    { 0x76, 0x02 },
    { 0x77, 0x36 },
    { 0x78, 0x88 },
    { 0x79, 0x81 },
    { 0x7a, 0x81 },
    { 0x7b, 0x22 },
    { 0x7c, 0xff },
    { 0x93, 0x48 },
    { 0x94, 0x00 },
    { 0x95, 0x05 },
    { 0x96, 0xe8 },
    { 0x97, 0x40 },
    { 0x98, 0xf0 },
    { 0xb1, 0x38 },
    { 0xb2, 0x38 },
    { 0xbd, 0x38 },
    { 0xbe, 0x36 },
#if 0
    { 0xd0, 0xc9 },
    { 0xd1, 0x10 },
    { 0xd3, 0x80 },
    { 0xd5, 0xf2 },
    { 0xd6, 0x16 },
#else
    //default AEC setting
    { 0xd0, 0xca },
    { 0xd1, 0x21 },
    { 0xd3, 0x48 },
    { 0xd5, 0xf2 },
    { 0xd6, 0x18 },
#endif
    { 0xdb, 0x92 },
    { 0xdc, 0xa5 },
    { 0xdf, 0x23 },
    { 0xd9, 0x00 },
    { 0xda, 0x00 },
    { 0xe0, 0x09 },
    { 0xed, 0x04 },
#if 0
    //default max dgain
    {0xee, 0xa0},
    {0xef, 0x40},
#else
    //increased max dgain
    { 0xee, 0xc0 },
    { 0xef, 0x60 },
#endif
    { 0x80, 0x03 },
    { 0x80, 0x03 },
    // { 0x9F, 0x10 },
    // { 0xA0, 0x20 },
    // { 0xA1, 0x38 },
    // { 0xA2, 0x4E },
    // { 0xA3, 0x63 },
    // { 0xA4, 0x76 },
    // { 0xA5, 0x87 },
    // { 0xA6, 0xA2 },
    // { 0xA7, 0xB8 },
    // { 0xA8, 0xCA },
    // { 0xA9, 0xD8 },
    // { 0xAA, 0xE3 },
    // { 0xAB, 0xEB },
    // { 0xAC, 0xF0 },
    // { 0xAD, 0xF8 },
    // { 0xAE, 0xFD },
    // { 0xAF, 0xFF },
    { 0x9F, 0x15 },
    { 0xA0, 0x2A },
    { 0xA1, 0x4A },
    { 0xA2, 0x67 },
    { 0xA3, 0x79 },
    { 0xA4, 0x8C },
    { 0xA5, 0x9A },
    { 0xA6, 0xB3 },
    { 0xA7, 0xC5 },
    { 0xA8, 0xD5 },
    { 0xA9, 0xDF },
    { 0xAA, 0xE8 },
    { 0xAB, 0xEE },
    { 0xAC, 0xF3 },
    { 0xAD, 0xFA },
    { 0xAE, 0xFD },
    { 0xAF, 0xFF },
    /*
    GC0308_GAMMA_Select,
    1://smallest gamma curve
    {0x9F , 0x0B},
    {0xA0 , 0x16},
    {0xA1 , 0x29},
    {0xA2 , 0x3C},
    {0xA3 , 0x4F},
    {0xA4 , 0x5F},
    {0xA5 , 0x6F},
    {0xA6 , 0x8A},
    {0xA7 , 0x9F},
    {0xA8 , 0xB4},
    {0xA9 , 0xC6},
    {0xAA , 0xD3},
    {0xAB , 0xDD},
    {0xAC , 0xE5},
    {0xAD , 0xF1},
    {0xAE , 0xFA},
    {0xAF , 0xFF},
    2:
    {0x9F , 0x0E},
    {0xA0 , 0x1C},
    {0xA1 , 0x34},
    {0xA2 , 0x48},
    {0xA3 , 0x5A},
    {0xA4 , 0x6B},
    {0xA5 , 0x7B},
    {0xA6 , 0x95},
    {0xA7 , 0xAB},
    {0xA8 , 0xBF},
    {0xA9 , 0xCE},
    {0xAA , 0xD9},
    {0xAB , 0xE4},
    {0xAC , 0xEC},
    {0xAD , 0xF7},
    {0xAE , 0xFD},
    {0xAF , 0xFF},
    3:
    {0x9F , 0x10},
    {0xA0 , 0x20},
    {0xA1 , 0x38},
    {0xA2 , 0x4E},
    {0xA3 , 0x63},
    {0xA4 , 0x76},
    {0xA5 , 0x87},
    {0xA6 , 0xA2},
    {0xA7 , 0xB8},
    {0xA8 , 0xCA},
    {0xA9 , 0xD8},
    {0xAA , 0xE3},
    {0xAB , 0xEB},
    {0xAC , 0xF0},
    {0xAD , 0xF8},
    {0xAE , 0xFD},
    {0xAF , 0xFF},
    4:
    {0x9F , 0x14},
    {0xA0 , 0x28},
    {0xA1 , 0x44},
    {0xA2 , 0x5D},
    {0xA3 , 0x72},
    {0xA4 , 0x86},
    {0xA5 , 0x95},
    {0xA6 , 0xB1},
    {0xA7 , 0xC6},
    {0xA8 , 0xD5},
    {0xA9 , 0xE1},
    {0xAA , 0xEA},
    {0xAB , 0xF1},
    {0xAC , 0xF5},
    {0xAD , 0xFB},
    {0xAE , 0xFE},
    {0xAF , 0xFF},
    5://largest gamma curve
    {0x9F , 0x15},
    {0xA0 , 0x2A},
    {0xA1 , 0x4A},
    {0xA2 , 0x67},
    {0xA3 , 0x79},
    {0xA4 , 0x8C},
    {0xA5 , 0x9A},
    {0xA6 , 0xB3},
    {0xA7 , 0xC5},
    {0xA8 , 0xD5},
    {0xA9 , 0xDF},
    {0xAA , 0xE8},
    {0xAB , 0xEE},
    {0xAC , 0xF3},
    {0xAD , 0xFA},
    {0xAE , 0xFD},
    {0xAF , 0xFF},
    */
    //-----------GAMMA Select End--------------//
    { 0xc0, 0x00 },
    { 0xc1, 0x10 },
    { 0xc2, 0x1C },
    { 0xc3, 0x30 },
    { 0xc4, 0x43 },
    { 0xc5, 0x54 },
    { 0xc6, 0x65 },
    { 0xc7, 0x75 },
    { 0xc8, 0x93 },
    { 0xc9, 0xB0 },
    { 0xca, 0xCB },
    { 0xcb, 0xE6 },
    { 0xcc, 0xFF },
    { 0xf0, 0x02 },
    { 0xf1, 0x01 },
    { 0xf2, 0x01 },
    { 0xf3, 0x30 },
    { 0xf9, 0x9f },
    { 0xfa, 0x78 },
    //{0xfa , 0x58},//Change measure window Y1 from 480 to 352
    //-------------------------------------------------
    { 0xfe, 0x01 }, // set page1
    { 0x00, 0xf5 },
    { 0x02, 0x1a },
    { 0x0a, 0xa0 },
    { 0x0b, 0x60 },
    { 0x0c, 0x08 },
    { 0x0e, 0x4c },
    { 0x0f, 0x39 },
    { 0x11, 0x3f },
    { 0x12, 0x72 },
    { 0x13, 0x13 },
    { 0x14, 0x42 },
    { 0x15, 0x43 },
    { 0x16, 0xc2 },
    { 0x17, 0xa8 },
    { 0x18, 0x18 },
    { 0x19, 0x40 },
    { 0x1a, 0xd0 },
    { 0x1b, 0xf5 },
#if 1
    { 0x54, 0x22 }, // subsample 1/2 by wqq
#endif
    { 0x70, 0x40 },
    { 0x71, 0x58 },
    { 0x72, 0x30 },
    { 0x73, 0x48 },
    { 0x74, 0x20 },
    { 0x75, 0x60 },
    { 0x77, 0x20 },
    { 0x78, 0x32 },
    { 0x30, 0x03 },
    { 0x31, 0x40 },
    { 0x32, 0xe0 },
    { 0x33, 0xe0 },
    { 0x34, 0xe0 },
    { 0x35, 0xb0 },
    { 0x36, 0xc0 },
    { 0x37, 0xc0 },
    { 0x38, 0x04 },
    { 0x39, 0x09 },
    { 0x3a, 0x12 },
    { 0x3b, 0x1C },
    { 0x3c, 0x28 },
    { 0x3d, 0x31 },
    { 0x3e, 0x44 },
    { 0x3f, 0x57 },
    { 0x40, 0x6C },
    { 0x41, 0x81 },
    { 0x42, 0x94 },
    { 0x43, 0xA7 },
    { 0x44, 0xB8 },
    { 0x45, 0xD6 },
    { 0x46, 0xEE },
    { 0x47, 0x0d },
    { 0xfe, 0x00 }, //set page0
    //-----------Update the registers 2010/07/06-------------//
    //Registers of Page0
    { 0xfe, 0x00 }, //set page0
    { 0x10, 0x26 },
    { 0x11, 0x0d }, //fd
    { 0x1a, 0x2a }, //1e
    { 0x1c, 0x49 }, //c1
    { 0x1d, 0x9a }, //08
    { 0x1e, 0x61 }, //60
    { 0x3a, 0x20 },
    { 0x50, 0x14 }, //10
    { 0x53, 0x80 },
    { 0x56, 0x80 },
    { 0x8b, 0x20 }, //LSC
    { 0x8c, 0x20 },
    { 0x8d, 0x20 },
    { 0x8e, 0x14 },
    { 0x8f, 0x10 },
    { 0x90, 0x14 },
    { 0x94, 0x02 },
    { 0x95, 0x07 },
    { 0x96, 0xe0 },
    { 0xb1, 0x40 }, //YCPT
    { 0xb2, 0x40 },
    { 0xb3, 0x40 },
    { 0xb6, 0xe0 },
    //{0xd0 , 0xcb},//AECT    c9,modifed by mormo 2010/07/06
    //{0xd3 , 0x48},//80,modified by mormor 2010/07/06
    { 0xf2, 0x02 },
    //{0xf7 , 0x12},
    //{0xf8 , 0x0a},
    //Registers
    { 0xfe, 0x01 }, // set page1
    { 0x02, 0x20 },
    { 0x04, 0x10 },
    { 0x05, 0x08 },
    { 0x06, 0x20 },
    { 0x08, 0x0a },
    { 0x0e, 0x44 },
    { 0x0f, 0x32 },
    { 0x10, 0x41 },
    { 0x11, 0x37 },
    { 0x12, 0x22 },
    { 0x13, 0x19 },
    { 0x14, 0x44 },
    { 0x15, 0x44 },
    { 0x19, 0x50 },
    { 0x1a, 0xd8 },
    { 0x32, 0x10 },
    { 0x35, 0x00 },
    { 0x36, 0x80 },
    { 0x37, 0x00 },
    //-----------Update the registers end---------//
    { 0xfe, 0x00 }, //set page0
    { 0xd2, 0x90 },
#endif
};

static uint8_t image_sensor_read_id(void);
static uint8_t image_sensor_regs_config(void);

void cam_clk_out(void)
{
    GLB_Set_I2S_CLK(ENABLE, GLB_I2S_OUT_REF_CLK_NONE);
    PDS_Set_Audio_PLL_Freq(AUDIO_PLL_24576000_HZ);
    GLB_Set_Chip_Out_1_CLK_Sel(GLB_CHIP_CLK_OUT_I2S_REF_CLK);
}

uint8_t image_sensor_init(BL_Fun_Type mjpeg_en, cam_device_t *cam_cfg, mjpeg_device_t *mjpeg_cfg)
{
    i2c_register(I2C0_INDEX, "i2c");
    image_sensor_i2c = device_find("i2c");

    if (image_sensor_i2c) {
        device_open(image_sensor_i2c, 0);
    }

    if (image_sensor_read_id()) {
        MSG("err1\r\n");
        return 1;
    }

    if (image_sensor_regs_config()) {
        MSG("err2\r\n");
        return 1;
    }

    mjpeg_stop();

    cam_register(CAM0_INDEX, "camera0");
    struct device *cam0 = device_find("camera0");

    if (!cam0) {
        MSG("cam do not find\r\n");
        return 1;
    }

    if (mjpeg_en) {
        mjpeg_init(mjpeg_cfg);
    }

    CAM_DEV(cam0)->hsp = CAM_HSPOLARITY_HIGH;
    CAM_DEV(cam0)->vsp = CAM_VSPOLARITY_HIGH;
    CAM_DEV(cam0)->software_mode = cam_cfg->software_mode;
    CAM_DEV(cam0)->frame_mode = cam_cfg->frame_mode;
    CAM_DEV(cam0)->yuv_format = cam_cfg->yuv_format;
    CAM_DEV(cam0)->cam_write_ram_addr = cam_cfg->cam_write_ram_addr;
    CAM_DEV(cam0)->cam_write_ram_size = cam_cfg->cam_write_ram_size;
    CAM_DEV(cam0)->cam_frame_size = cam_cfg->cam_frame_size;
    CAM_DEV(cam0)->cam_write_ram_addr1 = cam_cfg->cam_write_ram_addr1;
    CAM_DEV(cam0)->cam_write_ram_size1 = cam_cfg->cam_write_ram_size1;
    CAM_DEV(cam0)->cam_frame_size1 = cam_cfg->cam_frame_size1;
#if (CAM_MODE == CAM_USING_INT_MODE)
    device_open(cam0, DEVICE_OFLAG_INT_RX);
#elif (CAM_MODE == CAM_USING_POLL_MODE)
    device_open(cam0, DEVICE_OFLAG_STREAM_RX);
#endif
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  image_sensor_write_byte
 *
 * @param  addr: Register address
 * @param  data: data
 *
 * @return None
 *
*******************************************************************************/
uint8_t image_sensor_write_byte(uint8_t cmd, uint8_t data)
{
    i2c_msg_t msg1;

    msg1.slaveaddr = I2C_CAMERA_ADDR,
    msg1.len = 1,
    msg1.buf = &data;
    msg1.flags = SUB_ADDR_1BYTE | I2C_WR;
    msg1.subaddr = cmd;

    return i2c_transfer(image_sensor_i2c, &msg1, 1);
}

/****************************************************************************/ /**
 * @brief  image_sensor_read_byte
 *
 * @param  addr: Register address
 * @param  rdata: data
 *
 * @return None
 *
*******************************************************************************/
uint8_t image_sensor_read_byte(uint8_t cmd)
{
    i2c_msg_t msg1;
    uint8_t temp;
    msg1.len = 1,
    msg1.buf = &temp;
    msg1.subaddr = cmd;
    msg1.slaveaddr = I2C_CAMERA_ADDR,
    msg1.flags = SUB_ADDR_1BYTE | I2C_RD;
    i2c_transfer(image_sensor_i2c, &msg1, 1);

    return temp;
}

/****************************************************************************/ /**
 * @brief  CAMERA Read ID
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
static uint8_t image_sensor_read_id(void)
{
    uint8_t buf[2] = { 0 };
#if (IMAGE_SENSOR_USE == IMAGE_SENSOR_BF2013)
    buf[0] = image_sensor_read_byte(BF2013_ID_MSB);
    bflb_platform_delay_ms(10);
    buf[1] = image_sensor_read_byte(BF2013_ID_LSB);

    if (buf[0] == 0x37 && buf[1] == 0x03) {
        return SUCCESS;
    } else {
        return ERROR;
    }
#elif (IMAGE_SENSOR_USE == IMAGE_SENSOR_GC0308)
    buf[0] = image_sensor_read_byte(GC0308_ID);

    // MSG("image_sensor id:0x%2x\r\n",buf[0]);
    if (buf[0] == 0x9b) {
        return SUCCESS;
    } else {
        return ERROR;
    }
#endif
}

static uint8_t image_sensor_regs_config(void)
{
    int i;

    for (i = 0; i < sizeof(sensorRegList) / sizeof(sensorRegList[0]); i++) {
        if (image_sensor_write_byte(sensorRegList[i][0], sensorRegList[i][1]) != SUCCESS) {
            return ERROR;
        }

        bflb_platform_delay_ms(1);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Dump image sensor register while is set
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void image_sensor_dump_regs(void)
{
    uint32_t i;

    for (i = 0; i < sizeof(sensorRegList) / sizeof(sensorRegList[0]); i++) {
        MSG("reg[%02x]: %02x\n", sensorRegList[i][0], image_sensor_read_byte(sensorRegList[i][0]));
    }
}

/* cam cdc case use gpio & timer*/

void tr_gpio_init(void)
{
    gpio_set_mode(GPIO_PIN_22, GPIO_OUTPUT_PP_MODE);
    gpio_write(GPIO_PIN_22, 0);
}

struct device *timer_ch0_comp2 = NULL;

void timer_ch0_irq_callback(struct device *dev, void *args, uint32_t size, uint32_t state)
{
    static uint32_t i = 0;

    if (i & 1) {
        gpio_write(GPIO_PIN_22, 1);
    } else {
        gpio_write(GPIO_PIN_22, 0);
    }
}

void tr_timer_init(void)
{
    timer_register(TIMER0_INDEX, "timer_ch0_comp2");

    timer_ch0_comp2 = device_find("timer_ch0_comp2");

    if (timer_ch0_comp2) {
        TIMER_DEV(timer_ch0_comp2)->timeout1 = 1000;
        TIMER_DEV(timer_ch0_comp2)->trigger = TIMER_PRELOAD_TRIGGER_COMP0;
        device_open(timer_ch0_comp2, 0);
        device_set_callback(timer_ch0_comp2, timer_ch0_irq_callback);
    }
}

void trigger_init(void)
{
    tr_gpio_init();
    tr_timer_init();
}
